


Network Working Group                                          P. Psenak
Internet-Draft                                              S. Mirtorabi
Expires: July 16, 2006                                            A. Roy
                                                               L. Nguyen
                                                       P. Pillay-Esnault
                                                           Cisco Systems
                                                        January 12, 2006


                  Multi-Topology (MT) Routing in OSPF
                       draft-ietf-ospf-mt-05.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on July 16, 2006.

Copyright Notice

   Copyright (C) The Internet Society (2006).

Abstract

   This draft describes an extension to OSPF in order to define
   independent IP topologies called Multi-Topologies (MTs).  The MT
   extension can be used for computing different paths for unicast
   traffic, multicast traffic, different classes of service based on
   flexible criteria, or an in-band network management topology.



Psenak, et al.            Expires July 16, 2006                 [Page 1]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   [M-ISIS] describes a similar mechanism for ISIS.

   An optional extension to exclude selected links from the default
   topology is also described.

Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1   Differences with RFC 1583 TOS Based Routing  . . . . . . .  4
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  5
     2.1   Requirements notation  . . . . . . . . . . . . . . . . . .  5
     2.2   Terms  . . . . . . . . . . . . . . . . . . . . . . . . . .  5
   3.  Base MT Functional Specifications  . . . . . . . . . . . . . .  6
     3.1   MT Area Boundary . . . . . . . . . . . . . . . . . . . . .  6
     3.2   Adjacency for MTs  . . . . . . . . . . . . . . . . . . . .  6
     3.3   Sending OSPF control packets . . . . . . . . . . . . . . .  6
     3.4   Advertising MT Adjacencies and the Corresponding IP
           Prefixes . . . . . . . . . . . . . . . . . . . . . . . . .  6
       3.4.1   Advertising MT Adjacencies and the Corresponding
               IP Prefixes  . . . . . . . . . . . . . . . . . . . . .  6
       3.4.2   Inter-Area and External Routing  . . . . . . . . . . .  7
     3.5   Flushing MT Information  . . . . . . . . . . . . . . . . .  7
     3.6   MT SPF Computation . . . . . . . . . . . . . . . . . . . .  7
     3.7   MT-ID Values . . . . . . . . . . . . . . . . . . . . . . .  8
     3.8   Forwarding in MT . . . . . . . . . . . . . . . . . . . . .  8
   4.  Default Topology Link Exclusion Functional Specifications  . .  9
     4.1   Exclusion of Links in the Default Topology . . . . . . . .  9
     4.2   New Area Data Structure Parameter  . . . . . . . . . . . .  9
     4.3   Adjacency Formation with Link Exclusion Capability . . . . 10
     4.4   OSPF Control Packets Transmission Over Excluded Links  . . 11
     4.5   OSPF LSA Advertisement and SPF Computation for
           Excluded Links . . . . . . . . . . . . . . . . . . . . . . 11
   5.  Interoperability between MT Capable and Non-MT Capable
       Routers  . . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     5.1   Demand Circuit Compatibility Considerations  . . . . . . . 12
   6.  Migration from non-MT-Area to MT-area  . . . . . . . . . . . . 13
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 14
   8.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 15
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 16
     9.1   Normative References . . . . . . . . . . . . . . . . . . . 16
     9.2   Informative References . . . . . . . . . . . . . . . . . . 16
       Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 16
   A.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 18
   B.  OSPF data formats  . . . . . . . . . . . . . . . . . . . . . . 19
     B.1   Router-LSAs  . . . . . . . . . . . . . . . . . . . . . . . 19
     B.2   Network-LSAs . . . . . . . . . . . . . . . . . . . . . . . 20
     B.3   Summary-LSAs . . . . . . . . . . . . . . . . . . . . . . . 20
     B.4   AS-External-LSAs . . . . . . . . . . . . . . . . . . . . . 21



Psenak, et al.            Expires July 16, 2006                 [Page 2]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


     B.5   NSSA-LSAs  . . . . . . . . . . . . . . . . . . . . . . . . 22
       Intellectual Property and Copyright Statements . . . . . . . . 23

















































Psenak, et al.            Expires July 16, 2006                 [Page 3]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


1.  Introduction

   OSPF uses a fixed packet format, therefore it is not easy to
   introduce any backward compatible extensions.  However, the OSPF
   specification [OSPF] introduced TOS metric in an earlier
   specification [RFC1583] in order to announce a different link cost
   based on TOS.  TOS based routing as described in [RFC1583] was never
   deployed and was subsequently deprecated.

   We propose to reuse the TOS based metric fields.  They have been
   redefined as MT-ID and MT-ID Metric and are used to advertise
   different topologies by advertising separate metrics for each of
   them.

1.1  Differences with RFC 1583 TOS Based Routing

   Multi-topology routing differs from RFC 1583 TOS based routing in the
   following ways:

   1.  With RFC 1583 TOS routing, the TOS or DSCP in the IP header is
       mapped directly to the the corresponding OSPF SPF calculation and
       routing table.  This limits the number and definition of the
       topologies to the 16 TOS values specified is section 12.3 of RFC
       1583 [RFC1583].  With multi-topology routing, the classification
       of what type of traffic maps to which topology is not within the
       scope of the document.

   2.  With RFC 1583 TOS routing, traffic which is unreachable in the
       routing table associated with the corresponding TOS will revert
       to the TOS 0 routing table.  With multi-topology routing, this is
       optional.

   3.  With RFC 1583 TOS routing, individual links or prefixes could not
       be excluded from a topology.  If the LSA options T-bit was set,
       all links or prefixes were either advertised explicitly or
       defaulted to the TOS 0 metric.  With multi-topology routing,
       links or prefixes that are not advertised for a specific topology
       do not exist in that topology.













Psenak, et al.            Expires July 16, 2006                 [Page 4]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


2.  Terminology

2.1  Requirements notation

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119 [RFC2119].

2.2  Terms

   We define the following terminology in this document:

   Non-MT router
      Routers that do not have the MT capability

   MT router
      Routers that have MT capability as described in this document

   MT-ID
      Renamed TOS field in LSAs to represent multitopology ID.

   Default topology
      Topology that is built using the TOS 0 metric (default metric)

   MT topology
      Topology that is built using the corresponding MT-ID metric

   MT
      Shorthand notation for MT topology

   MT#0 topology
      Representation of TOS 0 metric in MT-ID format

   Non-MT-Area
      An area that contains only non-MT routers

   MT-Area
      An area that contains both non-MT routers and MT routers or only
      MT routers












Psenak, et al.            Expires July 16, 2006                 [Page 5]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


3.  Base MT Functional Specifications

3.1  MT Area Boundary

   Each OSPF interface belongs to a single area and all MTs sharing that
   link need to belong to the same area.  Therefore the area boundaries
   for all MTs are the same but each MT's attachment to the area is
   independent.

3.2  Adjacency for MTs

   Each interface can be configured to belong to a set of topologies.  A
   single adjacency will be formed with neighbors on the interface even
   if the interface is configured to participate in multiple topologies.
   Furthermore, adjacency formation will be independent of the
   topologies configured for the interface or neighbors on that
   interface.

3.3  Sending OSPF control packets

   Sending OSPF control packets is unchanged from RFC2328.  For OSPF
   control packets sent to the remote end of a virtual link, the transit
   area path MUST be composed solely of links in the default topology
   and the OSPF control packets MUST be forwarded using the default
   topology.

3.4  Advertising MT Adjacencies and the Corresponding IP Prefixes

   We will reuse the TOS metric field in order to advertise a topology
   and prefixes belonging to that topology.  The TOS field is redefined
   as MT-ID in the payload of Router-LSAs, Summary-LSAs, NSSA-LSAs, and
   AS-External-LSAs (see Appendix A).

   MT-ID metrics in LSAs SHOULD be in ascending order of MT-ID.  If an
   MT-ID exists in an LSA or router link multiple times, the metric in
   the first MT-ID instance MUST be used.

3.4.1  Advertising MT Adjacencies and the Corresponding IP Prefixes

   When a router establishes a FULL adjacency over a link that belongs
   to a set of MTs, it will advertise the corresponding cost for each
   MT-ID.

   By default, all links are included in default topology and all
   advertised prefixes belonging to the default topology will use the
   TOS0 metric the same as in standard OSPF [OSPF].

   Each MT has its own MT-ID metric field.  When a link is not part of a



Psenak, et al.            Expires July 16, 2006                 [Page 6]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   given MT, the corresponding MT-ID metric is excluded from the LSA.

   The Network-LSA does not contain any MT information since the DR is
   shared by all MTs.  Hence, there is no change to the Network-LSA.

3.4.2  Inter-Area and External Routing

   In Summary-LSAs, NSSA-LSAs, and AS-External-LSAs, the TOS metric
   fields are defined as MT-ID metric fields and are used in order to
   advertise prefix and router reachability in the corresponding
   topology.

   When a router originates a Summary-LSA, NSSA-LSA, or AS-External-LSA
   that belongs to a set of MTs, it will include the corresponding cost
   for each MT-ID.  By default, the router participates in the default
   topology and uses the TOS0 metric for the default topology the same
   as in standard OSPF [OSPF].

   Setting the P-bit in NSSA-LSAs is topology independent and pertains
   to all MT-ID advertised in the body of the LSA.

3.5  Flushing MT Information

   When a certain link or prefix that existed or was reachable in a
   certain topology is no longer part of that topology or is unreachable
   in that topology, a new version of the LSA must be originated
   excluding metric information representing the link or prefix in that
   topology.

   The MT metric in the Router-LSA can also be set to the maximum
   possible metric to enable the router to become a stub in a certain
   topology [STUB].

3.6  MT SPF Computation

   By considering MT-ID metrics in the LSAs, OSPF will be able to
   compute multiple topologies and find paths to IP prefixes for each MT
   independently.  A separate SPF will be computed for each MT-ID to
   find independent paths to IP prefixes.  Each nexthop computed during
   the MT SPF MUST belong to the same MT.

   Network-LSAs are used by all topologies during the SPF computation.
   During the SPF for a given MT-ID, only the links and metrics for that
   MT-ID will be considered.  Entries in the Router Routing table will
   be MT-ID specific.

   During the SPF computation for the default topology only the TOS0
   metric is considered during the SPF computation.



Psenak, et al.            Expires July 16, 2006                 [Page 7]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


3.7  MT-ID Values

   Since AS-External-LSAs use the high order bit in the MT-ID field (E
   bit) for the external metric-type, only MT-IDs in the range [0-127]
   are valid.  The following MT-ID values are reserved:

           0 - Reserved for advertising the metric associated with the
               default topology (see Section 4.2)

           1 - Reserved for advertising the metric associated with the
               default multicast topology

   MT-IDs [128-255] SHOULD be ignored.

3.8  Forwarding in MT

   It's outside of the scope of this document to specify how the
   information in various topology specific forwarding structures are
   used during packet forwarding or how incoming packets are associated
   with the corresponding topology.  For correct operation, both
   forwarding behavior and methods of associating incoming packets to a
   corresponding topology must be consistently applied in the network.





























Psenak, et al.            Expires July 16, 2006                 [Page 8]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


4.  Default Topology Link Exclusion Functional Specifications

   The multi-topologies imply that all the routers participate in the
   default topology.  However, it can be useful to exclude some links
   from the default topology and reserve them for some specific classes
   of traffic.

   The multi-topologies extension for default topology link or prefix
   exclusion is described in the following subsections.

4.1  Exclusion of Links in the Default Topology

   OSPF does not have the notion of an unreachable link.  All links can
   have a maximum metric of 0xFFFF advertised in the Router-LSA.  The
   link exclusion capability requires routers to ignore TOS0 metrics in
   Router-LSAs in the default topology and to alternately use the MT-
   ID#0 metric to advertise the metric associated with the default
   topology.  Hence, all routers within an area MUST agree on how the
   metric for default topology will be advertised.

   The unused T-bit is defined as the MT-bit in the option field in
   order to  assure that a multi-topology link-excluding capable router
   will only form an adjacency with another similarly configured router.


           +---+---+---+---+---+---+---+---+
           |DN |O  |DC |EA |NP |MC |E  |MT |
           +---+---+---+---+---+---+---+---+

       MT-bit: This bit MUST be set in Hello and Database Description
               packets only if DefaultExclusionCapability is enabled
               (see Section 4.2)



4.2  New Area Data Structure Parameter

   We define a new parameter in the Area Data Structure:

   DefaultExclusionCapability
      This configurable parameter ensures that all routers in an area
      have this capability enabled before the default topology can be
      disabled on a router link in the area without causing backward
      compatibility problems.

   When an area data structure is created the DefaultExclusionCapability
   is disabled by default.




Psenak, et al.            Expires July 16, 2006                 [Page 9]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   If DefaultExclusionCapability is disabled:

   o  The MT-bit MUST be cleared in Hello and Database Description
      packets.

   o  If a link participates in a non-default topology, it is
      automatically included in the default topology to support backward
      compatibility between MT and non-MT routers.  This is accomplished
      through advertisement via the TOS0 metric field the same as in
      standard OSPF [OSPF].

   If DefaultExclusionCapability is enabled:

   o  The MT-bit MUST be set in Hello and Database Description packets

   o  The router will only accept a Hello or Database Description packet
      if the MT-bit is set (see Section 4.3)

   When DefaultExclusionCapability is set to enabled a router is said to
   be operating in DefaultExclusionCapability mode.

4.3  Adjacency Formation with Link Exclusion Capability

   In order to have a smooth transition from a non-MT area to an MT-
   area, an MT router with DefaultExclusionCapability disabled will form
   adjacencies with non-MT routers and will include all links as part of
   default topology.

   A link may cease participating in default topology if
   DefaultExclusionCapability is set to enabled.  In this state, a
   router will only form adjacency with routers that set the MT-bit in
   their Hello and Database Description packets.  This will ensure that
   all routers have DefaultExclusionCapability enabled before the
   default topology can be disabled on a link.

   Receiving OSPF Hello packets as defined in section 10.5 of [OSPF] is
   modified as follows:

   o  If the DefaultExclusionCapability in the Area Data structure is
      set to enabled, Hello packets are discarded if the the received
      packet does not have the MT-bit set in the header options.

   Receiving OSPF Database Description packets as defined in section
   10.6 of [OSPF] is modified as follows:







Psenak, et al.            Expires July 16, 2006                [Page 10]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


      If the DefaultExclusionCapability in the Area Data structure is
      set to enabled, Database Description packets are discarded if the
      the received packet does not have the MT-bit set in the header
      options.  The neighbor state is not modified to allow a window of
      RouterDeadInterval seconds where the neighbor's
      DefaultExclusionCapability may be upgraded.


4.4  OSPF Control Packets Transmission Over Excluded Links

   If DefaultExclusionCapability is enabled, the default topology can be
   disabled on an interface.  Disabling the default topology on an
   interface does not impact the installation of connected routes for
   the interface in the default topology.  It only affects what a router
   advertises in its Router-LSA.

   This allows OSPF control packets to be sent and received over an
   interface even if the default topology is disabled on the interface.

4.5  OSPF LSA Advertisement and SPF Computation for Excluded Links

   When DefaultExclusionCapability is enabled and the link does not
   participate in the default topology, the MT-ID#0 metric is not
   advertised.  The link's TOS0 metric is ignored during the default
   topology SPF computation.

   When DefaultExclusionCapability is enabled and a link participates in
   the default topology, MT-ID#0 metric is used to advertise the metric
   associated with the default topology.  The link's TOS0 metric is
   ignored during the default topology SPF computation.

   Independent of the DefaultExclusionCapability setting, the TOS0
   metric is used for Summary-LSAs, NSSA-LSAs, and AS-External-LSAs.

   o  If the prefix or router does not exist in the default topology,
      the TOS0 metric is set to infinity (0xFFFFFF).

   o  If the prefix or router exists in default the topology, the TOS0
      metric is used to advertise the metric in the default topology.

   During the summary and external prefix calculation for the default
   topology the TOS0 metric is used for Summary-LSAs, NSSA-LSAs, and AS-
   External-LSAs.








Psenak, et al.            Expires July 16, 2006                [Page 11]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


5.  Interoperability between MT Capable and Non-MT Capable Routers

   The default metric field is mandatory in all LSAs (even when metric
   value is 0).  Even when a link or prefix does not exist in the
   default topology, a non-MT router can consider the zero value in the
   metric field as a valid metric and consider the link or prefix as
   part of the default topology.

   In order to prevent the above problem, an MT capable router will
   include all links as part of the default topology.  If links need to
   be removed from the default topology, an MT capable router MUST be
   configured in DefaultExclusionCapability mode.  In this mode,
   routers will assure that all other routers in the area are in the
   DefaultExclusionCapability mode before considering the MT-ID#0 metric
   in the SPF calculation.  Only then can the TOS0 metric field in
   Router LSAs be safely ignored during the default topology SPF
   computation.

   Note that for any prefix or router to become reachable in a certain
   topology, a contiguous path inside that topology must exist between
   the calculating router and the destination prefix or router.

5.1  Demand Circuit Compatibility Considerations

   A change to an area's DefaultExclusionCapability requires additional
   processing for area neighbors that are suppressing hellos as
   specified in "Extending OSPF to Support Demand Circuits" [DEMAND].
   When the DefaultExclusionCapability for an area is changed, hello
   suppression must be disabled for these neighbors for a period of
   RouterDeadInterval seconds.  This implies that hello packets are sent
   with the DC bit clear as specified in section 3.2.1 of [DEMAND]
   during this period.  After RouterDeadInterval seconds, either the
   adjacency will be taken down due to rejection of hellos with a
   conflicting MT-bit or hello suppression will be renegotiated.

















Psenak, et al.            Expires July 16, 2006                [Page 12]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


6.  Migration from non-MT-Area to MT-area

   Introducing MT-OSPF into a network can be done gradually to allow MT
   routers and non-MT routers to participate in the default topology
   while MT routers participate in other topologies.

   If there is a requirement to exclude some links from the default
   topology in an area, all routers in the area MUST be in
   DefaultExclusionCapability mode.  In this section we describe the
   migration steps to consider while transitioning from a non-MT network
   to an MT network.

   Consider a network with a backbone area and a set of non-backbone
   areas functioning in standard OSPF mode.  We would like to migrate to
   an MT network either partially or completely.

   1.  As required, part of an area is upgrade to be MT capable.  The MT
       routers will interact with non-MT routers in the default topology
       and participate in other topologies as required.

   2.  If a new non-backbone area is created for MT routers, it may be
       configured in DefaultExclusionCapability mode since there is no
       interaction required with non-MT routers.  In this mode, the
       default topology can be excluded on links as required.

   3.  If there is more than one non-backbone areas where MT is being
       used, it is desirable that the backbone area first be upgraded to
       be MT capable so that inter-area routing is assured for MT
       destinations in different areas.

   4.  Gradually the whole network can be made MT capable.

   Note that inter-area routing for the MT-area still depends on the
   backbone area.  Therefore, if different areas configured for a given
   topology need to communicate, the backbone area also needs to be
   configured for this topology.















Psenak, et al.            Expires July 16, 2006                [Page 13]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


7.  Security Considerations

   This document does not raise any security issues that are not already
   covered in [OSPF].















































Psenak, et al.            Expires July 16, 2006                [Page 14]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


8.  IANA Considerations

   The T-bit as defined in [RFC1583] for a router's TOS capability is
   redefined as the MT-bit in this document.  Similarly, the TOS field
   for Router-LSAs, Summary-LSAs, NSSA-LSAs, and AS-External LSAs as
   defined in [OSPF] is redefined as MT-ID in this document.













































Psenak, et al.            Expires July 16, 2006                [Page 15]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


9.  References

9.1  Normative References

   [DEMAND]   Moy, J., "Extending OSPF to Support Demand Circuits",
              RFC 1793, April 1995.

   [NSSA]     Murphy, P., "The OSPF Not-So-Stubby Area (NSSA) Option",
              RFC 3101, January 2003.

   [OSPF]     Moy, J., "OSPF Version 2", RFC 2328, April 1998.

   [RFC1583]  Moy, J., "OSPF Version 2", RFC 1583, March 1994.

   [RFC2119]  Bradner, S., "Key words for use in RFC's to Indicate
              Requirement Levels", RFC 2119, March 1997.

9.2  Informative References

   [M-ISIS]  Przygienda, T., Shen, N., and N. Sheth, "M-ISIS: Multi
             Topology (MT) Routing in IS-IS",
             draft-ietf-isis-wg-multi-topology-07.txt (work in
             progress).

   [STUB]    Retana, A., Nguyen, L., White, R., Zinin, A., and D.
             McPherson, "OSPF Stub Router Advertisement", RFC 3137,
             June 2001.


Authors' Addresses

   Peter Psenak
   Cisco Systems
   Parc Pegasus, De Kleetlaan 6A
   1831 Diegem
   Belgium

   Email: ppsenak@cisco.com


   Sina Mirtorabi
   Cisco Systems
   225 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sina@cisco.com




Psenak, et al.            Expires July 16, 2006                [Page 16]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   Abhay Roy
   Cisco Systems
   225 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: akr@cisco.com


   Liem Nguyen
   Cisco Systems
   7025 Kit Creek Road
   Research Triangle Park, NC  27709
   USA

   Email: lhnguyen@cisco.com


   Padma Pillay-Esnault
   Cisco Systems
   225 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: ppe@cisco.com


























Psenak, et al.            Expires July 16, 2006                [Page 17]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


Appendix A.  Acknowledgments

   The authors would like to thank Scott Sturgess, Alvaro Retana, David
   Kushi, Yakov Rekhter, Tony Przygienda, and Naiming Shen for their
   comments on the document.  Special thanks to Acee Lindem for editing
   and to Tom Henderson for an extensive review during the OSPF Working
   Group last call.












































Psenak, et al.            Expires July 16, 2006                [Page 18]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


Appendix B.  OSPF data formats

   LSA content defined in [OSPF] is modified to introduce the MT-ID.

B.1  Router-LSAs

   Router-LSAs are the Type 1 LSAs.  Each router in an area originates a
   router-LSA.  The LSA describes the state and cost of the router's
   links (i.e., interfaces) to the area.  All of the router's links to
   the area must be described in a single router-LSA.  For details
   concerning the construction of router-LSAs, see Section 12.4.1
   [OSPF].


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |            LS age             |     Options   |       1       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                        Link State ID                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     Advertising Router                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     LS sequence number                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |         LS checksum           |             length            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |*|*|*|N|W|V|E|B|        0      |            # links            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                          Link ID                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                         Link Data                             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |     # MT-ID   |            metric             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     MT-ID     |       0       |          MT-ID  metric        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                              ...                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     MT-ID     |       0       |          MT-ID  metric        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                          Link ID                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                         Link Data                             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                              ...                              |





Psenak, et al.            Expires July 16, 2006                [Page 19]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


B.2  Network-LSAs

   Network-LSAs are the Type 2 LSAs.  A network-LSA is originated for
   each broadcast and NBMA network in the area which supports two or
   more routers.  The network-LSA is originated by the network's
   Designated Router.  The LSA describes all routers attached to the
   network, including the Designated Router itself.  The LSA's Link
   State ID field lists the IP interface address of the Designated
   Router.

   The distance from the network to all attached routers is zero.  This
   is why metric fields need not be specified in the network-LSA.  For
   details concerning the construction of network-LSAs, see Section
   12.4.2 [OSPF].


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |            LS age             |      Options  |      2        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                        Link State ID                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     Advertising Router                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     LS sequence number                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |         LS checksum           |             length            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                         Network Mask                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                        Attached Router                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                              ...                              |

   Note that network LSA does not contain any MT-ID fields as the cost
   of the network to the attached routers is 0 and DR is shared by all
   topologies.

B.3  Summary-LSAs

   Summary-LSAs are the Type 3 and 4 LSAs.  These LSAs are originated by
   area border routers.  Summary-LSAs describe inter-area destinations.
   For details concerning the construction of summary- LSAs, see Section
   12.4.3 [OSPF].

   Type 3 summary-LSAs are used when the destination is an IP network.
   In this case the LSA's Link State ID field is an IP network number



Psenak, et al.            Expires July 16, 2006                [Page 20]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   (if necessary, the Link State ID can also have one or more of the
   network's "host" bits set; see Appendix E [OSPF] for details).  When
   the destination is an AS boundary router, a Type 4 summary-LSA is
   used, and the Link State ID field is the AS boundary router's OSPF
   Router ID.  (To see why it is necessary to advertise the location of
   each ASBR, consult Section 16.4 of [OSPF]).  Other than the
   difference in the Link State ID field, the format of Type 3 and 4
   summary-LSAs is identical.


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |            LS age             |     Options   |    3 or 4     |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                        Link State ID                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     Advertising Router                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                     LS sequence number                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |         LS checksum           |             length            |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                         Network Mask                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       0       |                  metric                       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     MT-ID     |                MT-ID  metric                  |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                              ...                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     MT-ID     |                MT-ID  metric                  |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


B.4  AS-External-LSAs

   AS-external-LSAs are the Type 5 LSAs.  These LSAs are originated by
   AS boundary routers, and describe destinations external to the AS.
   For details concerning the  construction of AS-external-LSAs, see
   Section 12.4.3 [OSPF].

   AS-external-LSAs usually describe a particular external destination.
   For these LSAs the Link State ID field specifies an IP network number
   (if necessary, the Link State ID can also have one or more of the
   network's "host" bits set; see Appendix E [OSPF] for details).  AS-
   external-LSAs are also used to describe a default route.  Default
   routes are used when no specific route exists to the destination.



Psenak, et al.            Expires July 16, 2006                [Page 21]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


   When describing a default route, the Link State ID is always set to
   DefaultDestination (0.0.0.0) and the Network Mask is set to 0.0.0.0.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |            LS age             |     Options   |      5        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Link State ID                          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                     Advertising Router                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                     LS sequence number                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |         LS checksum           |             length            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                         Network Mask                          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |E|     0       |                  metric                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Forwarding address                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      External Route Tag                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |E|    MT-ID    |              MT-ID  metric                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Forwarding address                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      External Route Tag                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |E|    MT-ID    |              MT-ID  metric                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Forwarding address                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      External Route Tag                       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


B.5  NSSA-LSAs

   NSSA-LSAs are the Type 7 LSAs.  These LSAs are originated by AS
   boundary routers local to an NSSA, and describe destinations external
   to the AS.  The changes to NSSA-LSAs are identical to those for
   External-LSAs (Appendix A.4.5).  For details concerning the
   construction of NSSA-LSAs see Section 2.4 [NSSA].



Psenak, et al.            Expires July 16, 2006                [Page 22]

Internet-Draft     Multi-Topology (MT) Routing in OSPF      January 2006


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2006).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Psenak, et al.            Expires July 16, 2006                [Page 23]



